---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteInsertService
source: html/256ced3f-2af9-482b-6cbf-8ac7774d4321.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteInsertService Property

The external service which permits registration of an alternate implementation for Site insert.

## Syntax (C#)
```csharp
public static ExternalServiceId SiteInsertService { get; }
```